{
  "basics": {
    "name": "Sam Messina",
    "picture": "https://smessina.com/images/sm_fav.png",
    "email": "sam@smessina.com",
    "phone": "231.633.0681",
    "website": "https://smessina.com",
    "location": {
      "city": "Chicago",
      "countryCode": "US",
      "region": "Illinois"
    }
  },
  "work": [
    {
      "company": "Topstep LLC",
      "position": "Front End Developer & Digital Marketer",
      "website": "https://www.topsteptrader.com",
      "startDate": "2018-06-01",
      "summary": "As lead front end developer and digital marketing engineer, I sit between marketing and tech to create reusable front end assets, implement digital marketing tools, orchestrate testing and data analysis, and automate marketing processes.",
      "highlights": [
        "Lead front end engineering by developing templates using Python's Django, Hubspot HubL, and MJML as well as Angular 2 components and custom Wordpress themes using Gulp, SCSS, and ES6 JavaScript, ensuring performance and accessibility",
        "Design, develop, and implement a component library, using Webpack to compile ES6 JavaScript and SCSS into static JavaScript and CSS, able to be easily added to any tech stack",
        "Increase conversion rate by 10% through a new attribution solution using Google Analytics, Hubspot, and PostgreSQL",
        "Orchestrate Search Engine Optimization (SEO) strategy resulting in a 25% increase in organic search traffic",
        "Lead hiring process for front end development positions, implementing technical tests and question sets to verify skills",
        "Manage tracking pixels, analytics solutions, and attribution systems to monitor and measure all digital marketing efforts"
      ]
    },
    {
      "company": "Southern Illinois University",
      "position": "Web Developer & Research Assistant",
      "website": "https://www.siu.edu",
      "startDate": "2014-01-20",
      "endDate": "2018-05-15",
      "summary": "Working on the university website gave me the opportunity to write custom features for faculty, tech sessions on using our CMS, and help lead an holistic SEO initiative.",
      "highlights": [
        "Authored custom web pages, forms, and apps for university departments using HTML, CSS, JavaScript, and PHP",
        "Organized and led classes detailing basic HTML, content creation, and best UI/UX practices for ~200 users",
        "Designed and authored Python applications to speed up or automate bottlenecks in the team’s recurring workflows",
        "Updated HTML meta descriptions, titles, content tags, structured data, and page content, improving SEO site-wide"
      ]
    },
    {
      "company": "MacUpdate",
      "position": "Web Development Intern",
      "website": "https://www.macupdate.com",
      "startDate": "2016-06-01",
      "endDate": "2017-09-01",
      "summary": "I interned with MacUpdate for two consecutive summers. During my first internship, I was able to lead an initiative in bringing responsive design to the site for the first time. My second summer with MacUpdate, I led an SEO initiative improving page performance and on-page SEO.",
      "highlights": [
        "Created a custom front end module loader using Grunt and Node JS, which fully automated caching, bundling, and minification of front end assets, and reduced average page size by 15%, or ~250KB per page",
        "Organized an SEO audit, resulting in a 20% increase in organic search, equaling over 30,000 weekly sessions",
        "Introduced responsive design to the site by using Bootstrap, jQuery/JavaScript, CSS, and HTML to develop and implement a mobile responsive navigation bar and footer, deployed on all pages",
        "Designed and developed a customizable, metadata-driven automatic email system using PHP and MySQL, allowing marketing teammates to better target and track email campaigns and increase conversion rate"

      ]
    }

  ],
  "education": [
    {
      "institution": "Southern Illinois University",
      "area": "Computer Science",
      "studyType": "B.S.",
      "endDate": "2018-05-15",
      "gpa": "3.74"
    }
  ],
  "skills": [

    {
      "name": "Languages",
      "keywords": [
        "Javascript,",
        "HTML,",
        "CSS,",
        "Python,",
        "PHP,",
        "MySQL,",
        "PostgreSQL,",
        "Java,",
        "C"
      ]
    },
    {
      "name": "Libraries",
      "keywords": [
        "React JS,",
        "Angular 1,",
        "Angular 4,",
        "jQuery,",
        "Bootstrap,",
        "Node,",
        "Django,",
        "Wordpress,",
        "MJML,",
        "Mustache,",
        "SCSS"
      ]
    },
    {
      "name": "Tools",
      "keywords": [
        "Git,",
        "Gulp,",
        "Grunt,",
        "Webpack,",
        "Vim,",
        "Google Analytics,",
        "Google Search Console,",
        "Google Tag Manager,",
        "Hubspot,",
        "Linux"
      ]
    }
  ],
  "publications": [
    {
      "name": "PersonaList",
      "releaseDate": "2018-10-01",
      "website": "personalist.smessina.com",
      "summary": "PersonaList allows users to add comments to Spotify playlists, for easier playlist collaboration. PersonaList uses the Spotify API to pull data into a NodeJS server. The app is dynamically rendered with React, using the React Hooks API to acheive a functional model throughout the app."
    },
    {
      "name": "Git Flow",
      "releaseDate": "2017-05-01",
      "website": "gitflow.smessina.com",
      "summary": "Git Flow is an interactive git tutorial that walks users through a git workflow via a step-by-step flowchart. Written in React, tutorial content is dynamically generated by manipulating React component state as users work through the flowchart."
    },
    {
      "name": "OrderUp HookUp",
      "releaseDate": "2016-08-01",
      "website": "orderuphookup.smessina.com",
      "summary": "OrderUp HookUp is a restaurant locator, which uses a Node and Express REST API to cross-reference Google location services with the Yelp Fusion Cloud API to find nearby restaurants. OrderUpHookUp is rendered using Angular 1."
    }
  ]
}
