{
  "basics": {
    "name": "Sam Messina",
    "picture": "https://smessina.com/images/sm_fav.png",
    "email": "sam@smessina.com",
    "phone": "231.633.0681",
    "website": "https://smessina.com",
    "location": {
      "city": "Chicago",
      "countryCode": "US",
      "region": "Illinois"
    }
  },
  "work": [
    {
      "company": "TopstepTrader",
      "position": "Front End Developer",
      "website": "https://www.topsteptrader.com",
      "startDate": "2018-06-01",
      "summary": "As the first front end developer at TopstepTrader, collaborate cross-departmentally to create reusable front end assets, maintain a high standard of front end focussed code and architecture, orchestrate testing and data analysis, and automate marketing processes.",
      "highlights": [
        "Architected <strong>micro frontend</strong> solution to enable migration from an <strong>Angular 2</strong> monolith into a leaner, <strong>React</strong> solution",
        "Led front end engineering efforts across a variety of stacks",
        "Designed, developed, and implemented a reusable component library to convert modern components into static, cross-browser-ready artifacts",
        "Improved first paint time 300% through a site migration from <strong>Wordpress</strong> to a faster <strong>Node</strong> and <strong>Gulp</strong> solution",
        "Led front end developer hiring by creating technical tests and interview processes",
        "Administrated tracking pixels, analytics solutions, and attribution systems to monitor all digital marketing efforts"
      ]
    },
    {
      "company": "Southern Illinois University",
      "position": "Student Web Developer",
      "website": "https://www.siu.edu",
      "startDate": "2014-01-20",
      "endDate": "2018-05-15",
      "summary": "Working on the university website gave me the opportunity to write custom features for faculty, teach sessions on using our CMS, and help lead an holistic SEO initiative.",
      "highlights": [
        "Authored custom web pages, forms, and apps for university departments",
        "Designed and authored <strong>Python</strong> applications to automate bottlenecks in the team’s recurring workflows",
        "Organized and led classes on basic <strong>HTML</strong>, content creation, and best UI/UX practices for >200 users"
      ]
    },
    {
      "company": "MacUpdate",
      "position": "Web Developer Intern",
      "website": "https://www.macupdate.com",
      "startDate": "2016-06-01",
      "endDate": "2017-09-01",
      "summary": "I interned with MacUpdate for two consecutive summers. During my first internship, I was able to lead an initiative in bringing responsive design to the site for the first time. My second summer with MacUpdate, I led an SEO initiative improving page performance and on-page SEO.",
      "highlights": [
        "Designed and implemented a front end build process, which fully automated front end asset builds and reduced average page size by 15%, or ~250KB per page",
        "Organized an <strong>SEO</strong> audit and action plan, resulting in an organic search increase of 20%, or 30k+ sessions weekly",
        "Introduced the site's first responsive design with a responsive navigation bar and footer",
        "Developed a customizable, metadata-driven automatic email system, allowing better targeted email campaigns"
      ]
    },
    {
      "company": "Self-Employed",
      "position": "Musician",
      "startDate": "2010-05-01",
      "endDate": "2014-01-01"
    }
  ],
  "education": [
    {
      "institution": "Southern Illinois University",
      "area": "Computer Science",
      "studyType": "B.S.",
      "endDate": "2018-05-15",
      "gpa": "3.74"
    }
  ],
  "skills": [
    {
      "name": "Languages",
      "keywords": [
        "JavaScript,",
        "HTML,",
        "CSS,",
        "SCSS,",
        "Python,",
        "PHP,",
        "MySQL,",
        "PostgreSQL,",
        "Java,",
        "Bash",
        "C"
      ]
    },
    {
      "name": "Libraries",
      "keywords": [
        "React,",
        "AngularJS,",
        "Angular 2-4,",
        "jQuery,",
        "Bootstrap,",
        "Node,",
        "Django,",
        "Wordpress,",
        "SCSS"
      ]
    },
    {
      "name": "Tools",
      "keywords": [
        "Git,",
        "Webpack,",
        "Gulp,",
        "Grunt,",
        "Linux",
        "Vim,",
        "Hubspot,",
        "Google Analytics & Search Console,"
      ]
    }
  ],
  "publications": [
    {
      "name": "WAILto",
      "releaseDate": "2019-10-01",
      "website": "wailto.smessina.com",
      "summary": "WAILto (or What Am I Listening To) is a way to analyze your own music listening trends and history. "
    },
    {
      "name": "personaList",
      "releaseDate": "2018-10-01",
      "website": "personalist.smessina.com",
      "summary": "With personaList, you can comment up every song in your Spotify playlist. Pages are dynamically generated with JavaScript to show Spotify API data."
    },
    {
      "name": "Git Flow",
      "releaseDate": "2017-05-01",
      "website": "gitflow.smessina.com",
      "summary": "Git Flow is an interactive git tutorial that walks users through a git workflow via a step-by-step flowchart."
    }
  ]
}
