{
  "basics": {
    "name": "Sam Messina",
    "picture": "https://smessina.com/images/sm_fav.png",
    "email": "sam@smessina.com",
    "phone": "",
    "website": "https://smessina.com",
    "location": {
      "city": "Denver",
      "countryCode": "US",
      "region": "CO"
    }
  },
  "work": [
    {
      "company": "Maxwell",
      "position": "Senior Software Engineer",
      "website": "https://www.himaxwell.com",
      "startDate": "2021-07-15",
      "summary": "",
      "highlights": [
        "Led initiative adding screen sharing functionality to the primary web application",
        "Created, launched, and contributed to the Maxwell engineering blog"
      ]
    },
    {
      "company": "Bitovi",
      "position": "JavaScript Developer",
      "website": "https://www.bitovi.com",
      "startDate": "2020-02-15",
      "endDate": "2021-07-01",
      "summary": "As a JavaScript consultant, I worked across the stack in a variety of applications to support our client. Whether it was designing new applications to process COVID-19 Payment Protection Program loans in 2020, or enhancing performance on legacy loan administration applications, I provided flexible, results-driven development support for clients.",
      "highlights": [
        "Developed spreadsheet application using <strong>RxJS</strong> and <strong>React</strong>, supporting reference cells and formulas",
        "Implemented cross-project <strong>micro frontend</strong> solution in <strong>React</strong> to transition from a legacy app to a new architecture while still adding new features, fixing old bugs, and addressing tech debt",
        "Deployed backend services in <strong>Node</strong> and <strong>Koa</strong> to integrate with <strong>React</strong> apps as well as third party services",
        "Managed a &ldquo;squad&rdquo; of four developers, focused on a single client application"
      ]
    },
    {
      "company": "TopstepTrader",
      "position": "Front End Developer",
      "website": "https://www.topsteptrader.com",
      "startDate": "2018-06-01",
      "endDate": "2020-02-15",
      "summary": "As the first front end developer at TopstepTrader, collaborate cross-departmentally to create reusable front end assets, maintain a high standard of front end focused code and architecture, orchestrate testing and data analysis, and automate marketing processes.",
      "highlights": [
        "Architected <strong>micro frontend</strong> solution to migrate from an <strong>Angular 2</strong> monolith into a leaner, <strong>React</strong> solution",
        "Led front end engineering team across a tech stacks including <strong>Angular 2</strong>, <strong>React</strong>, <strong>Python Django</strong> templates, <strong>Hubspot HubL</strong>, custom <strong>Wordpress</strong> themes, and native <strong>HTML/CSS/JavaScript</strong>",
        "Designed, developed, and implemented a reusable component library, using <strong>Webpack</strong> to compile modular <strong>ES6+ JavaScript</strong> and <strong>SCSS</strong> into static, cross-browser-ready <strong>JavaScript</strong> and <strong>CSS</strong>",
        "Improved first paint time 300% through a site migration from <strong>Wordpress</strong> to a faster <strong>Node</strong> and <strong>Gulp</strong> solution",
        "Led front end developer hiring by creating technical tests and interview processes to verify candidates' skills"
      ]
    },
    {
      "company": "MacUpdate",
      "position": "Web Developer Intern",
      "website": "https://www.macupdate.com",
      "startDate": "2016-06-01",
      "endDate": "2017-09-01",
      "summary": "I interned with MacUpdate for two consecutive summers. During my first internship, I was able to lead an initiative in bringing responsive design to the site for the first time. My second summer with MacUpdate, I led an SEO initiative improving page performance and on-page SEO.",
      "highlights": [
        "Designed and implemented a front end build process using <strong>Grunt</strong> and <strong>Node</strong>, which fully automated caching, bundling, and minification of front end assets, and reduced average page size by 15%, or ~250KB per page",
        "Introduced responsive design using <strong>Bootstrap</strong>, <strong>jQuery/JavaScript,</strong> <strong>CSS</strong>, and <strong>HTML</strong>"
      ]
    },
    {
      "company": "Southern Illinois University",
      "position": "Student Developer",
      "website": "https://www.siu.edu",
      "startDate": "2014-01-20",
      "endDate": "2018-05-15",
      "summary": "Working on the university website gave me the opportunity to write custom features for faculty, teach sessions on using our CMS, and help lead an holistic SEO initiative.",
      "highlights": [
        "Authored web pages, forms, and apps for university departments using <strong>HTML</strong>, <strong>CSS</strong>, <strong>JavaScript</strong>, and <strong>PHP</strong>",
        "Organized and led classes detailing basic <strong>HTML</strong>, content creation, and best <strong>UI/UX</strong> practices for >200 users"
      ]
    }
  ],
  "education": [
    {
      "institution": "Southern Illinois University",
      "area": "Computer Science",
      "studyType": "B.S.",
      "startDate": "2014-01-15",
      "endDate": "2018-05-15",
      "gpa": "3.74"
    }
  ],
  "skills": [
    {
      "name": "Languages",
      "keywords": [
        "JavaScript,",
        "HTML,",
        "CSS,",
        "SCSS,",
        "Python,",
        "PHP,",
        "MySQL,",
        "PostgreSQL,",
        "Java,",
        "Bash",
        "C"
      ]
    },
    {
      "name": "Libraries",
      "keywords": [
        "React,",
        "Angular,",
        "Node,",
        "RxJS,",
        "Redux,",
        "Django,",
        "Wordpress,",
        "SCSS"
      ]
    },
    {
      "name": "Tools",
      "keywords": [
        "Git,",
        "Webpack,",
        "Gulp,",
        "Grunt,",
        "nx",
        "Linux",
        "Vim,",
        "Hubspot,",
        "Google Analytics & Search Console,"
      ]
    }
  ],
  "publications": [
    {
      "name": "HUB",
      "releaseDate": "2021-07-01",
      "website": "hubert.wiki",
      "summary": "HUB is a personal wiki with full markdown and SMS upload support. HUB uses <strong>React</strong>, <strong>Node</strong>, <strong>Mongo</strong>, and <strong>Webhooks</strong> to provide customizable wikis that can be updated from anywhere."
    },
    {
      "name": "WAILto",
      "releaseDate": "2019-10-10",
      "website": "wailto.smessina.com",
      "summary": "WAILto is a music history analysis app. Using <strong>Node</strong>, <strong>React Hooks</strong>, and <strong>PostgreSQL</strong>, WAILto provides modular, extensible data analysis and <strong>data visualizations</strong> on Last.fm data."
    }
  ]
}
